# #Задача 26:  Напишите программу, которая на вход принимает два числа A и B, 
# #и возводит число А в целую степень B с помощью рекурсии.

# #*Пример:*

# #A = 3; B = 5 -> 243 (3⁵)
# #A = 2; B = 3 -> 8 

def power(n,num):
    if num == 1:
        return n
    if num != 1:
        return n * power(n, num - 1)

n = int (input('Введите число:'))   
num = int (input('Введите степень:')) 
print (power(n, num))

# Задача 28: Напишите рекурсивную функцию sum(a, b), 
# возвращающую сумму двух целых неотрицательных чисел. 
# Из всех арифметических операций допускаются только +1 и -1. Также нельзя использовать циклы.

# *Пример:*

# 2 2
#     4 

def sum_number(a, b):
    if a == 0:
        return b
    if a !=0:
        return sum_number(a - 1, b + 1)

a = int (input('Первое число:'))
b = int (input ('Второе число:'))

print (sum_number(a, b))




